#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker]
azurerm_storage_account.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Storage/storageAccounts/stfuncnbnlocationchecker]
azurerm_application_insights.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Insights/components/appi-nbn-location-checker]
azurerm_service_plan.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/serverfarms/plan-nbn-location-checker]
azurerm_storage_container.app: Refreshing state... [id=https://stfuncnbnlocationchecker.blob.core.windows.net/content]
azurerm_storage_blob.app: Refreshing state... [id=https://stfuncnbnlocationchecker.blob.core.windows.net/content/cc8dcc845aab61171e854f4a6ef0512647f37aa8899af9b4153a476305d9d7db.zip]
azurerm_linux_function_app.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_application_insights.app has changed
  ~ resource "azurerm_application_insights" "app" {
        id                                    = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Insights/components/appi-nbn-location-checker"
        name                                  = "appi-nbn-location-checker"
      + tags                                  = {}
        # (15 unchanged attributes hidden)
    }

  # azurerm_linux_function_app.app has changed
  ~ resource "azurerm_linux_function_app" "app" {
        id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker"
        name                              = "func-nbn-location-checker"
      + tags                              = {}
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # azurerm_resource_group.rg has changed
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker"
        name     = "rg-nbn-location-checker"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.app has changed
  ~ resource "azurerm_service_plan" "app" {
        id                           = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/serverfarms/plan-nbn-location-checker"
        name                         = "plan-nbn-location-checker"
      + tags                         = {}
        # (10 unchanged attributes hidden)
    }

  # azurerm_storage_account.app has changed
  ~ resource "azurerm_storage_account" "app" {
        id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Storage/storageAccounts/stfuncnbnlocationchecker"
        name                              = "stfuncnbnlocationchecker"
      + tags                              = {}
        # (34 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_function_app.app will be updated in-place
  ~ resource "azurerm_linux_function_app" "app" {
      ~ app_settings                      = {
          ~ "WEBSITE_RUN_FROM_PACKAGE"   = (sensitive)
            # (2 unchanged elements hidden)
        }
        id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker"
        name                              = "func-nbn-location-checker"
        tags                              = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_blob.app must be replaced
-/+ resource "azurerm_storage_blob" "app" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stfuncnbnlocationchecker.blob.core.windows.net/content/cc8dcc845aab61171e854f4a6ef0512647f37aa8899af9b4153a476305d9d7db.zip" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "cc8dcc845aab61171e854f4a6ef0512647f37aa8899af9b4153a476305d9d7db.zip" -> "dc23c6a185460c20bcd51f9d7cda02919a0c66cd415cebdea1b3722c585da0e3.zip" # forces replacement
      ~ url                    = "https://stfuncnbnlocationchecker.blob.core.windows.net/content/cc8dcc845aab61171e854f4a6ef0512647f37aa8899af9b4153a476305d9d7db.zip" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @scottmckenzie, Action: `pull_request`*